{
  "plants": [
    {
      "id": 1,
      "species": "N. adnata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ædˈnɑːtə",
      "pronunciation_2": "ad-NAH-ter",
      "range": "Found predominantly on the inaccessible sandstone cliffs that characterise its known range, this species is one of the smallest in the genus.",
      "distribution": "This little species is endemic to the Sungai Campo (formerly Tjampo) region near to Harau, West Sumatra.",
      "altitude": "600–1200",
      "field_notes": "At the few sites where it is known and accessible, this species is severely threatened by collection, a shame since it is readily available from legitimate specialist nurseries."
    },
    {
      "id": 2,
      "species": "N. alata",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "əˈlɑːtə",
      "pronunciation_2": "uh-LAH-ter",
      "range": "Found from sea level to montane forest in a broad range of ecological niches, from lowland terrestrial to montane epiphytic.",
      "distribution": "Found throughout the Philippine archipelago, but especially prominent in Luzon and Mindanao. Records from Palawan are confused owing to the presence of superficially similar species there.",
      "altitude": "0–1400",
      "field_notes": "This highly variable species is one of the most commonly encountered in the Philippines. Its various forms have resulted in a number of published synonyms, and the taxonomy of this species is the subject of continuing studies. Nepenthes alata is one of the most commonly available members of the genus."
    },
    {
      "id": 3,
      "species": "N. alba",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˈælbə",
      "pronunciation_2": "AL-ber",
      "range": "This species favours damp to wet upper montane forest and scrub areas, being relatively common on Gunung Tahan, the peninsula's highest peak, and the highest peaks to the near east of that mountain.",
      "distribution": "Endemic to the mountains of Peninsular Malaysia, but restricted to peaks in the eastern part of the main range.",
      "altitude": "1600–2187",
      "field_notes": "A diminutive, but nonetheless very pretty species which is especially prominent in so-called 'bonsai forests' towards mountain summits; its pale to white upper pitchers contrast strongly with the mountain vegetation. This species is closely related to N. gracillima, but differs most obviously in size and colouration."
    },
    {
      "id": 4,
      "species": "N. albomarginata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": "1,2,3",
      "pronunciation_1": "ælbɵˌmɑrdʒɨˈnɑːtə",
      "pronunciation_2": "al-BO-margin-AAH-ter",
      "range": "Most commonly found in forested areas, predominantly in secondary vegetation or along ridge lines and summits, where light penetration is greater.",
      "distribution": "Though spread across Peninsular Malaysia, Sumatra and mainly western Borneo, this species is patchily distributed and relatively scarce.",
      "altitude": "0–1100",
      "field_notes": "Instantly recognisable on account of its striking white collar, this species is specialised for the capture of termites."
    },
    {
      "id": 5,
      "species": "N. ampullaria",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "lower",
      "pitcher_type_2": "upper",
      "regions": "1,2,3,5",
      "pronunciation_1": "æmpʊˈlɑːəriə",
      "pronunciation_2": "am-pu-LAR-ee-er or am-pu-LAIR-ee-er",
      "range": "Predominantly a species of the hot and humid lowlands, this species thrives in damp, sunny situations, but is remarkably shade tolerant, sometimes being found in deep shade forest habitats. In New Guinea, this species is found in certain highland areas.",
      "distribution": "One of the most widespread of all Nepenthes, ranging across Sumatra, Peninsular Malaysia, Singapore, Borneo and New Guinea, as well as the extreme south of Thailand.",
      "altitude": "0–2100",
      "field_notes": "Unmistakable and rather cute, Nepenthes ampullaria is a remarkable species that is both carnivorous and a facultative detritivore. That is, its open pitchers derive nourishment from leaf litter."
    },
    {
      "id": 6,
      "species": "N. andamana",
      "img_credit": "Marcello Catalano",
      "img_credit_2": "Marcello Catalano",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ændəˈmɑːnə",
      "pronunciation_2": "AN-der-MAH-ner",
      "range": "It grows terrestrially at sea level in coastal savannah and grassland.",
      "distribution": "This species is endemic to Phang Nga Province, Thailand.",
      "altitude": "0",
      "field_notes": "One of a number of closely related taxa from southernmost Thailand."
    },
    {
      "id": 7,
      "species": "N. angasanensis",
      "img_credit": "Simon Lumb",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "æŋɡəsəˈnɛnsɪs",
      "pronunciation_2": "ANG-gah-sah-NEN-sis",
      "range": "It grows terrestrially or epiphytically, in humid, upper montane forest and scrub, usually amidst sparse vegetation, thick moss or leaf litter in dappled shade.",
      "distribution": "Nepenthes angasanensis is known only from the highlands of the western Alas Valley and the Goh Lembuh massif in Aceh.",
      "altitude": "2200-2800",
      "field_notes": "This species is closely related to Nepenthes tobaica and N. mikei."
    },
    {
      "id": 8,
      "species": "N. appendiculata",
      "img_credit": "Greg Bourke",
      "img_credit_2": "Greg Bourke",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "æpɛndɪkjuːˈlɑːtə",
      "pronunciation_2": "AH!-pen-dick-you-LAH-ter",
      "range": "This species grows as an epiphyte in upper montane mossy forest.",
      "distribution": "Known only from the Hose Mountains of Sarawak, Borneo, where it has been observed only by its discoverers.",
      "altitude": "1450-1700",
      "field_notes": "It is likely that its altitudinal range is broader than indicated, but owing to its epiphytic habit and lack of further field observations, the exact figure is difficult to ascertain."
    },
    {
      "id": 9,
      "species": "N. argentii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ɑrˈdʒɛnti.aɪ",
      "pronunciation_2": "are-GENT-ee-eye",
      "range": "This species is restricted to a narrow altitudinal band amongst stunted, ultramafic growing montane scrub.",
      "distribution": "Endemic to the island of Sibuyan, Romblon Province, where it is known only from the summit and adjacent ridges of the Mount Guiting-Guiting.",
      "altitude": "1400–1900",
      "field_notes": "Conditions towards the summit of Mount Guiting-Guiting are harsh, the upper slopes being typically exposed to strong winds and nighttime cold. As such, the species has evolved as a fairly typical alpine, being perhaps the smallest in the entire genus. The slopes of its habitat are some of the hardest non-technical Nepenthes habitats to ascend, being both steep and littered with jagged and sharp ultramafic protrusions"
    },
    {
      "id": 10,
      "species": "N. aristolochioides",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ærɨˌstɒlɵkiˈɔɪdiːz",
      "pronunciation_2": "Aris-toe-lock-ee-oy-deez",
      "range": "It grows terrestrially or occasionally as an epiphyte, in mossy, lower and upper montane forest and scrub, often rooted in dense moss and leaf litter on the ground or on the branches and trunks of trees.",
      "distribution": "Nepenthes aristolochioides is known from only three locations within the Kerinci Seblat National Park, located in the province of Jambi, West Sumatra.",
      "altitude": "1800–2500",
      "field_notes": "This species is amongst the most threatened in nature owing to indiscriminate poaching in its range. Only a few sites remain, and these are threatened by the very visitors that come to admire them."
    },
    {
      "id": 11,
      "species": "N. attenboroughii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ætənnˈbɜri.aɪ",
      "pronunciation_2": "at-un-BURR-ee-eye",
      "range": "This species is found only at the summit regions of the Victoria Massif, Palawan, where it grows upon rocky free draining soil. Its habitat is scrubby and exposed, and plants receive intense sunshine and regular precipitation.",
      "distribution": "This species is endemic to Palawan island. It occurs only on the highest slopes of Mount Victoria and Mount Sagpaw.",
      "altitude": "1450–1726",
      "field_notes": "This magnificent species is one of the largest of all tropical pitcher plants. In common with the other true giants, it occurs at relatively low population densities within its restricted habitat. It is extremely slow growing. In 2012, a return expedition that included one of its original discoverers identified a pitcher in which the remains of a shrew were found."
    },
    {
      "id": 12,
      "species": "N. bellii",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˈbɛli.aɪ",
      "pronunciation_2": "BELL-ee-eye",
      "range": "This species grows on ultramafic soils, favouring slight shade in open lowland and hill forest, but it also fares well on roadside cuttings in certain areas.",
      "distribution": "A native of northern Mindanao and Dinagat, this species is sparsely distributed within its range, but may be locally common in some areas.",
      "altitude": "0–800",
      "field_notes": "Though clearly related to Nepenthes merilliana, this species is a true miniature, with upper pitchers rarely more than 10 cm tall and lowers that are only ever slightly larger. It tends to favour shady habitats more than its larger congener, but can also be found growing in full sun along road cuttings."
    },
    {
      "id": 13,
      "species": "N. benstonei",
      "img_credit": "Michael Lo",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "bɛnˈstoʊni.aɪ",
      "pronunciation_2": "ben-STONE-ee-eye",
      "range": "Nepenthes benstonei grows terrestrially, amidst sparse lowland forest on ridge sides, in recovering, secondary vegetation and on bare substrate in exposed areas, cliff sides and slopes.",
      "distribution": "Nepenthes benstonei is known with certainty only from the slopes of Bakar Hill (Bukit Bakar) and nearby low-lying hills in Kelantan, Peninsular Malaysia.",
      "altitude": "450–600",
      "field_notes": "A rather localised, but nonetheless interesting species. Populations of plants in the extreme southeast of Thailand may represent this taxon."
    },
    {
      "id": 14,
      "species": "N. bicalcarata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "baɪˌkælkəˈrɑːtə or bɪˌkælkəˈreɪtə",
      "pronunciation_2": "bye-KAL-ker-AH-ter",
      "range": "It mainly inhabits clearings in undisturbed, mossy peat swamp forests and lowland heath forests, but sometimes occurs amidst recovering scrub and secondary vegetation.",
      "distribution": "Nepenthes bicalcarata is endemic to the north west of Borneo and occurs predominantly in Sarawak and Brunei, but is also found in the south of Sabah and the northwest of Kalimantan.",
      "altitude": "0-300",
      "field_notes": "A striking plant that is instantly recognisable on account of its prominent fangs. This species is also unusual in having a symbiotic relationship with a species of ant that inhabits the tendrils of larger pitchers."
    },
    {
      "id": 15,
      "species": "N. bokorensis",
      "img_credit": "François Mey",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˌbɒkɒˈrɛnsɪs",
      "pronunciation_2": "bok-or-EN-sis",
      "range": "Nepenthes bokorensis occurs in seasonally wet, upland scrub and amidst sparse stunted, lower montane forest. It grows mainly in open habitat, exposed to strong or direct sunlight.",
      "distribution": "Nepenthes bokorensis occurs across the Dâmrei Mountains (Elephant Range) of south-western Cambodia.",
      "altitude": "800–1080",
      "field_notes": "This handsome species is one of the most easily identified of the so-called Indochinese pyrophyte species. It is sadly threatened by development of a casino and resort housing complex in a region whether neither facility is in demand."
    },
    {
      "id": 16,
      "species": "N. bongso",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˈbɒŋɡsoʊ",
      "pronunciation_2": "BONG-so",
      "range": "At lower elevations, this species grows mainly as an epiphyte amidst dense vegetation, often high on the branches of trees and shrubs of mossy, lower montane forest. In exposed areas, especially ridge sides and mountain summits, N. bongso grows in short, stunted upper montane forest or scrub.",
      "distribution": "Nepenthes bongso occurs across the provinces of North Sumatra, West Sumatra, Bengkulu and Jambi.",
      "altitude": "1000-2700",
      "field_notes": "This is a widespread and rather variable species."
    },
    {
      "id": 17,
      "species": "N. boschiana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌbɒʃiˈɑːnə",
      "pronunciation_2": "bosh-ee-AH-ner",
      "range": "Nepenthes boschiana occurs amidst stunted, montane vegetation, usually in little or no shade on limestone outcrops and ridge sides.",
      "distribution": "Nepenthes boschiana is endemic to South Kalimantan and is known to occur on Mount Sakumbang, the type locality, and Mount Besar.",
      "altitude": "1200-1800",
      "field_notes": "This species is both substantial and elegant, its apparent relationship with Nepenthes maxima, from nearby Sulawesi, is easy to appreciate."
    },
    {
      "id": 18,
      "species": "N. burbidgeae",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "bərˈbɪdʒi.aɪ",
      "pronunciation_2": "burr-BIJ-eye (commonly mispronounced as burr-bij-EE-eye, with 4 syllables)",
      "range": "It is mostly found growing amidst tall but sparse montane shrubs and trees on steep ridge sides and slopes.",
      "distribution": "Nepenthes burbidgeae is known only from Mount Kinabalu and Mount Tambuyukon, located within the Kinabalu National Park in Sabah.",
      "altitude": "1200-1800",
      "field_notes": "A truly handsome species with wonderfully patterned pitchers and peristomes of porcelain, brown and purple. It has one of the most commonly mispronounced names (the 3 syllable form being correct)."
    },
    {
      "id": 19,
      "species": "N. burkei",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˈbɜrki.aɪ",
      "pronunciation_2": "BURR-kee-eye",
      "range": "It grows terrestrially or occasionally as an epiphyte in or on the margins of sparse lower montane and mossy upper montane forest, and also amidst montane scrub in exposed open clearings.",
      "distribution": "Nepenthes burkei is known from the slopes of Mount Halcon, its lesser peak, Mount Ayam Bukong, particularly around the Aplaya Camp area, and the nearby headwaters of the Subaan River, Mindoro.",
      "altitude": "1100-2000",
      "field_notes": "This species is often confused with Nepenthes ventricosa, but the two taxa differ obviously when compared directly. This species has a strongly tilted mouth, the broad peristome becoming almost vertical towards the lid. Neither species grows together, and it is not known from outside of Mindoro, though closely related plants in the N. ventricosa complex found on adjacent Panay share some affinities with it."
    },
    {
      "id": 20,
      "species": "N. campanulata",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "kæmˌpænjuːˈlɑːtə",
      "pronunciation_2": "kam-pan-you-LAH-ter",
      "range": "It was observed growing as a lithophyte, rooted in scant, moist, mossy substrate on vertical limestone cliffs.",
      "distribution": "Originally discovered in 1957 growing on the vertical walls of Ilas Bungaan, or ‘flowering rock’, a remote limestone outcrop in East Kalimantan. N. campanulata was thereafter believed to be extinct. In 1997, a new population of this species was discovered by naturalist, Ch’ien Lee, growing on sheer limestone cliffs in the Gunung Mulu National Park in Sarawak.",
      "altitude": "300-500",
      "field_notes": "An unmistakable species with wonderful bell-shaped pitchers. Its only known locality in Mulu National Park is an astonishing 450+ kilometres away from its place of discovery."
    },
    {
      "id": 21,
      "species": "N. ceciliae",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "səˈsi.li.aɪ",
      "pronunciation_2": "sir-SEE-lee-eye",
      "range": "It grows terrestrially, scrambling across the ground, or climbing amidst sparse vegetation.",
      "distribution": "Nepenthes ceciliae is known only from Mt. Kiamo, Mindanao, and the opposite ridge north of the township of Kibalabag.",
      "altitude": "1500–1800",
      "field_notes": "This small species is readily encountered within its range, the small, but strongly climbing plants scrambling prettily over the stunted ridgetop vegetation."
    },
    {
      "id": 22,
      "species": "N. chang",
      "img_credit": "Marcello Catalano",
      "img_credit_2": "Marcello Catalano",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˌtʃæŋɡ",
      "pronunciation_2": "chang",
      "range": "This species grows terrestrially on peaty soil in open, steep forest.",
      "distribution": "Known with certainty only from the Banthad Mountains of central Thailand, where it has been recorded from two localities, Khao Kuap and the island of Ko Chang.",
      "altitude": "300-600",
      "field_notes": "One of a number of closely related taxa from southernmost Thailand."
    },
    {
      "id": 23,
      "species": "N. chaniana",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌtʃæniˈɑːnə",
      "pronunciation_2": "chan-ee-AH-ner",
      "range": "It grows terrestrially or as an epiphyte on humid, mossy ridge tops and mountain summits, usually amidst tall, sparse, lower or upper montane vegetation and often in relatively shaded situations.",
      "distribution": "N. chaniana occurs sporadically across Sabah, Sarawak and possibly also central Kalimantan.",
      "altitude": "1100-1800",
      "field_notes": "Although widespread across its range, this species is rather localised and not encountered very frequently."
    },
    {
      "id": 24,
      "species": "N. clipeata",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌklɪpiːˈɑːtə",
      "pronunciation_2": "clip-ee-AH-ter",
      "range": "Nepenthes clipeata originally occurred on the summit and cliff faces of Mount Kelam, a steep-sided granite outcrop in West Kalimantan.",
      "distribution": "The original populations of N. clipeata grew terrestrially, in eroded gullies, on ledges and in crevices amidst scant scrub and vegetation, usually in direct or strong sunlight.",
      "altitude": "600-800",
      "field_notes": "Though isolated individuals may persist in nature, this species is assumed to be extinct owing to indiscriminate poaching by opportunistic locals hoping to meet foreign demand for this striking species."
    },
    {
      "id": 25,
      "species": "N. copelandii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "koʊpˈlændi.aɪ",
      "pronunciation_2": "cope-LAN-dee-eye",
      "range": "It grows terrestrially or as an epiphyte in mossy, lower and upper montane forest and is particularly common on humid ridges.",
      "distribution": "Nepenthes copelandii is presently known with certainty from only two mountains on Mindanao: Mount Apo and Mount Pasian.",
      "altitude": "1400-1600",
      "field_notes": "A number of species from Mindanao are tentatively associated with this taxon, but the forms from Mount Apo are especially easy to distinguish, having narrowly trumpet shaped (infundibular) upper pitchers."
    },
    {
      "id": 26,
      "species": "N. danseri",
      "img_credit": "Heiko Rischer",
      "img_credit_2": "Heiko Rischer",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 5,
      "pronunciation_1": "ˈdænsəraɪ",
      "pronunciation_2": "DAN-ser-eye",
      "range": "It grows terrestrially amidst low growing scrub, sparse forest and open grasslands overlying ultramafic substrate.",
      "distribution": "This little-studied pitcher plant is known only from the remote north of Waigeo Island, to the west of New Guinea, and Halmahera Island, the largest of the Maluku Islands.",
      "altitude": "0-320",
      "field_notes": "This rarely encountered species is thought to be closely related to Nepenthes gracilis."
    },
    {
      "id": 27,
      "species": "N. deaniana",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˌdiːniˈɑːnə",
      "pronunciation_2": "dee-nee-AH-ner",
      "range": "Nepenthes deaniana grows terrestrially in mossy, upper montane forest and scrub. It occurs mostly in dappled shade, but also in strong or occasionally direct sunlight, and despite the relatively low altitude of its habitat, conditions are cool and humid.",
      "distribution": "This spectacular species was first discovered in 1907, but only seen again during a botanical expedition to central Palawan in 2007.",
      "altitude": "1200",
      "field_notes": "Plants previously sold in cultivation as Nepenthes deaniana were, after 2007, shown to belong to Nepenthes philippinensis, an entirely different species with little resemblance to this one."
    },
    {
      "id": 28,
      "species": "N. densiflora",
      "img_credit": "Simon Lumb",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌdɛnsɨˈflɔərə",
      "pronunciation_2": "den-sih-FLORA",
      "range": "At lower elevations, it grows terrestrially or occasionally as an epiphyte in mossy, lower and upper montane forest. At higher altitudes, it grows as a compact rosette on ridge tops and mountain summits amidst stunted montane scrub and heath, often in direct sunlight.",
      "distribution": "Nepenthes densiflora is known only from the highlands of the western Alas Valley and the Goh Lembuh massif in Aceh.",
      "altitude": "1700-3200",
      "field_notes": "This species is related to Nepenthes diatas and N. singalana, though it lacks the prominent peristome ribs seen in those species."
    },
    {
      "id": 29,
      "species": "N. diatas",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "daɪˈætəs",
      "pronunciation_2": "die-AH-tass",
      "range": "At lower elevations, it grows terrestrially or occasionally as an epiphyte in mossy, upper montane forest. At higher altitudes, it grows as a compact rosette amidst stunted highland scrub and heath vegetation, or in Sphagnum moss, often in direct sunlight.",
      "distribution": "Nepenthes diatas is known only from Mount Bandahara in Aceh.",
      "altitude": "2400-2900",
      "field_notes": "This high altitude species has a strongly ribbed peristome and is similar to Nepenthes singalana."
    },
    {
      "id": 30,
      "species": "N. distillatoria",
      "img_credit": "Joachim Nerz",
      "img_credit_2": "Joachim Nerz",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 6,
      "pronunciation_1": "dɨˌstɪləˈtɔəri.ə",
      "pronunciation_2": "diss-till-er-TORE-ee-er",
      "range": "It grows terrestrially on forest margins, favouring open or disturbed areas. Much of its lowland habitat has been destroyed.",
      "distribution": "This species is the only Nepenthes known from the island of Sri Lanka.",
      "altitude": "0-700",
      "field_notes": "One of the earliest Nepenthes species ever to be described, this species is not often cultivated or photographed in the wild."
    },
    {
      "id": 31,
      "species": "N. dubia",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˈduːbi.ə",
      "pronunciation_2": "DOO-bee-er",
      "range": "At lower elevations, N. dubia mostly grows as an epiphyte, perched on the mossy branches of lower montane trees. At higher altitudes, it grows mainly on the ground, climbing and scrambling through surrounding upper montane forest and scrub.",
      "distribution": "Nepenthes dubia is known only from the upper slopes of Mount Talakmau in West Sumatra.",
      "altitude": "1600-2700",
      "field_notes": "This very distinctive species is closely related to Nepenthes inermis, although unlike that species, it has a prominent peristome around the pitcher opening."
    },
    {
      "id": 32,
      "species": "N. edwardsiana",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 3,
      "pronunciation_1": "ɛdˌwɔrdziˈɑːnə",
      "pronunciation_2": "ed-ward-zee-AH-ner",
      "range": "It grows terrestrially or as an epiphyte in cool, damp, upper montane mossy forest, often receiving strong or direct sunlight for part of the day.",
      "distribution": "It occurs only on Mount Kinabalu and Mount Tambuyukon, Sabah.",
      "altitude": "1600-2700",
      "field_notes": "This strongly climbing species is as spectacular as it is hard to see, growing in rather localised spots on only two mountains in northern Sabah."
    },
    {
      "id": 33,
      "species": "N. ephippiata",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Jan Flisek",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ɛˌfɪpiˈɑːtə",
      "pronunciation_2": "eff-ip-ee-AH-ter",
      "range": "It grows terrestrially or occasionally as an epiphyte, in mossy upper montane forest on ridge tops and mountain summits.",
      "distribution": "It occurs across central Borneo, with records from Sarawak and Kalimantan.",
      "altitude": "1300-2000",
      "field_notes": "This species is closely related to Nepenthes lowii, but is nonetheless distinct, with broader upper pitchers and different petioles."
    },
    {
      "id": 34,
      "species": "N. epiphytica",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ɛpɪˈfɪtɪkə",
      "pronunciation_2": "eh-pih-FIH-tih-ker",
      "range": "This species grows exclusively as an epiphyte in montane forest. In spite of this, it is known only from limestone areas in the extreme east of Kalimantan.",
      "distribution": "This species has only been observed in the East Kutai and Berau regencies of Kalimantan by its original discoverers and the naturalists who recently described it.",
      "altitude": "1000",
      "field_notes": "This strict epiphyte has only been observed on a handful of occasions. Unusually, it is only known from limestone habitats even though it grows on the trunks of trees that are not restricted to such localities."
    },
    {
      "id": 35,
      "species": "N. eustachya",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "juːstˈækiːə",
      "pronunciation_2": "you-STAY-kee-er",
      "range": "It grows terrestrially in open heath forest, amongst degraded or recovering secondary vegetation, in logged lowland dipterocarp forest, on exposed cliffsides and landslide areas, and amidst sparse, low growing scrub on ridge tops and mountain summits. It favours strong or direct sunlight, and most often grows in substrate that overlies sandstone.",
      "distribution": "Nepenthes eustachya is known only from the provinces of West Sumatra and North Sumatra.",
      "altitude": "0–1600",
      "field_notes": "This lowland species is easily distinguished from other species by its characteristic pitchers."
    },
    {
      "id": 36,
      "species": "N. eymae",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 4,
      "pronunciation_1": "ˈeɪmaɪ",
      "pronunciation_2": "AY-my",
      "range": "It grows terrestrially in heath forest, degraded or recovering secondary vegetation, logged dipterocarp forest, on the banks of rivers and water courses, and on bare substrate on exposed cliffsides and landslide areas. At higher altitudes, it grows terrestrially or epiphytically in mossy, upper montane forest on ridges and mountain summits.",
      "distribution": "Nepenthes eymae is widely distributed across the highlands of West Sulawesi and Central Sulawesi provinces, including the East Peninsula of the latter region.",
      "altitude": "1000-2000",
      "field_notes": "Closely related to Nepenthes maxima, this species differs in having strongly flared upper pitchers, lower pitchers with peristomes that are proportionally widest just below the lid, and lids that are exceptionally narrow. In some areas it is found alongside N. maxima, but remains distinct, suggestion reproductive isolation. On Mount Lumut, it tends to grow at higher altitudes than N. maxima also."
    },
    {
      "id": 37,
      "species": "N. faizaliana",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌfaɪzæliˈɑːnə",
      "pronunciation_2": "f-eye-zal-ee-AH-ner",
      "range": "Nepenthes faizaliana mainly grows terrestrially, or occasionally as an epiphyte amidst stunted mossy lower and upper montane vegetation on exposed ridges.",
      "distribution": "Nepenthes faizaliana is known only from the limestone outcrops of the Gunung Mulu National Park in Sarawak.",
      "altitude": "400-1600",
      "field_notes": "A very handsome species with pitchers that are often of a woody or chocolate brown. This species is closely related to Nepenthes stenophylla."
    },
    {
      "id": 38,
      "species": "N. flava",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˈflɑːvə",
      "pronunciation_2": "FLAH-ver",
      "range": "Nepenthes flava grows terrestrially in mossy, upper montane forest and scrub.",
      "distribution": "Nepenthes flava is known only from the upper slopes of one peak in the Bukit Barisan mountain range in North Sumatra.",
      "altitude": "1800–2200",
      "field_notes": "This species has characteristically shaped upper pitchers with a rather angular peristome."
    },
    {
      "id": 39,
      "species": "N. fusca",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˈfʌskə",
      "pronunciation_2": "FUSS-ker or FOOS-ker",
      "range": "This species mainly grows as an epiphyte amidst dense vegetation, often high on the branches of lowland dipterocarp and lower montane forest trees.",
      "distribution": "Nepenthes fusca is widely distributed across Borneo.",
      "altitude": "600-2500",
      "field_notes": "This species varies widely across its range, and pitchers may range from cylindrical to trumpet shaped in form."
    },
    {
      "id": 40,
      "species": "N. gantungensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "gæntʊŋɡˈɛnsɪs",
      "pronunciation_2": "gan-toong-EN-sis",
      "range": "It grows terrestrially in low growing upper montane scrub and open montane forest .",
      "distribution": "Mount Gantung.",
      "altitude": "1650-1784",
      "field_notes": "This species is closely related to Nepenthes deaniana."
    },
    {
      "id": 41,
      "species": "N. glabrata",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 4,
      "pronunciation_1": "ˈɡlæbrɑːtə",
      "pronunciation_2": "glab-RAH-ter",
      "range": "It grows terrestrially or epiphytically in mossy, lower and upper montane forest and scrub, and also in degraded or recovering secondary vegetation, on exposed cliffsides and landslide areas.",
      "distribution": "Nepenthes glabrata occurs across the highlands of Central Sulawesi, from the mountains of Lore Lindu National Park in the west, to Mount Lumut and the Morowali Nature Reserve in the east.",
      "altitude": "1600–2100",
      "field_notes": "A pretty species that may festoon entire shrubs with its dainty pitchers. It is quite widespread and can climb to tremendous heights. Sites near Poso sport plants that climb well over 20 metres up into tall trees."
    },
    {
      "id": 42,
      "species": "N. glandulifera",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 3,
      "pronunciation_1": "ˌɡlændjuːˈlɪfɛrə",
      "pronunciation_2": "glan-dyoo-LIF-eh-rer",
      "range": "It occurs in stunted, mossy, montane forest and scrub on ridge tops.",
      "distribution": "Nepenthes glandulifera is known only from the Hose Mountains of Sarawak.",
      "altitude": "1100-1700",
      "field_notes": "This species has only been observed on a handful of occasions given the remoteness of its habitat."
    },
    {
      "id": 43,
      "species": "N. gracilis",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": "1,2,3",
      "pronunciation_1": "ˈɡræsɨlɪs",
      "pronunciation_2": "GRA-sill-iss or gruh-SILL-iss",
      "range": "The species grows in a very wide range of habitats, including open areas of bare, exposed earth, lowland peat swamps, heath forest, amongst scrub, secondary vegetation, the margins of lowland dipterocarp forest and the edges of padi fields.",
      "distribution": "Nepenthes gracilis occurs widely across Borneo, Sumatra (and surrounding minor islands), Singapore and Peninsular Malaysia. Localised populations of N. gracilis are also found in the extreme south of Thailand and in central Sulawesi, but the species is not widespread in these areas.",
      "altitude": "0-1100",
      "field_notes": "Though common, this species is attractive and highly variable across its range. It is a successful ruderal species, and can colonise disturbed sites quickly."
    },
    {
      "id": 44,
      "species": "N. gracillima",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ɡrəˈsɪlɨmə",
      "pronunciation_2": "gra-SILL-im-er",
      "range": "Nepenthes gracillima occurs amidst upper montane scrub on humid ridge tops.",
      "distribution": "Nepenthes gracillima is currently known with certainty only from the upper slopes of Mount Tahan in Taman Negara, Malaysia’s largest national park, in Pahang, Peninsular Malaysia.",
      "altitude": "1600–1700",
      "field_notes": "This species was previously confused with Nepenthes ramispina by certain botanists. However, field studies by researchers Alastair Robinson and Stewart McPherson demonstrated clear differences that were not apparent in dried herbarium specimens, some of which clearly represented mixed collections. Charles Clarke and Ch'ien Lee thereafter improved upon these initial observations with additional data gathered on Mount Tahan, providing a comprehensive comparison of this species with its closest relatives."
    },
    {
      "id": 45,
      "species": "N. gymnamphora",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "dʒɪmˈnæmfɔrə",
      "pronunciation_2": "jim-NAM-for-er",
      "range": "It is mainly found growing in humid, mossy, lower or upper montane forest near streams or lakes or on mountain slopes, the summits of low-lying peaks, ridge tops and cliffsides.",
      "distribution": "Nepenthes gymnamphora occurs widely across Sumatra and Java.",
      "altitude": "600–2800",
      "field_notes": ""
    },
    {
      "id": 46,
      "species": "N. hamata",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 4,
      "pronunciation_1": "həˈmɑːtə",
      "pronunciation_2": "her-MAH-ter",
      "range": "It grows terrestrially or epiphytically on ridges and mountain summits in humid, mossy, lower and upper montane forest and scrub, often in dappled shade.",
      "distribution": "Nepenthes hamata occurs in the highlands of Central Sulawesi, mainly in the east, including much of the East Peninsula, but also northwards into the Minahassa Peninsula.",
      "altitude": "1400-2500",
      "field_notes": "Perhaps the most iconic of Nepenthes species from Sulawesi, the sickle-toothed N. hamata is very striking. It is closely related to N. tentaculata, and while the taxa occur on the same mountains, N. hamata tends to grow at higher altitudes and is a significantly larger species."
    },
    {
      "id": 47,
      "species": "N. hamiguitanensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "hæmɪgɪtɑːˈnɛnsɪs",
      "pronunciation_2": "ham-ih-git-ahn-EN-sis",
      "range": "It grows terrestrially in montane forest and forest margins, usually in partial shade and often amongst dense vegetation.",
      "distribution": "Nepenthes hamiguitanensis is named after Mount Hamiguitan in San Isidro, Davao Oriental, Mindanao, where this plant endemically occurs.",
      "altitude": "1200–1600",
      "field_notes": "Now a stable species in its own right, Nepenthes hamiguitanensis is demonstrably of hybrid origin. However, recent field observations have shown that its likely parents are N. peltata and N. mindanaoensis, rather than N. peltata and N. micramphora as one believed."
    },
    {
      "id": 48,
      "species": "N. hemsleyana",
      "img_credit": "Greg Bourke",
      "img_credit_2": "Vincent Bazile",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˈhɛmzliˈɑːnə",
      "pronunciation_2": "hem-zlee-ahn-er",
      "range": "It grows in peat swamp forest and heath forest.",
      "distribution": "Nepenthes hemsleyana is endemic to Borneo.",
      "altitude": "0-200",
      "field_notes": "Formerly known as Nepenthes baramensis and N. rafflesiana var. elongata, this remarkable plant has been found to act as a roosting site for certain bats!"
    },
    {
      "id": 49,
      "species": "N. hirsuta",
      "img_credit": "Michael Lo",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "hərˈsjuːtə",
      "pronunciation_2": "her-SUIT-er",
      "range": "It is often found growing at the boundaries between lowland dipterocarp forest and lower montane forest, but also occurs in lowland peat swamps and amidst secondary vegetation.",
      "distribution": "Nepenthes hirsuta occurs across Borneo but is particularly widespread in Brunei and Sarawak.",
      "altitude": "200–1000",
      "field_notes": "This species can be remarkably shade tolerant, with plants often found beneath the deep shade of rainforest trees."
    },
    {
      "id": 50,
      "species": "N. hispida",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˈhɪspɪdə",
      "pronunciation_2": "HISS-pid-er",
      "range": "This species grows terrestrially, usually in dense vegetation in lowland forest clearings or on mossy cliffs.",
      "distribution": "Nepenthes hispida is only recorded with certainty from the Lambir Hills National Park in Sarawak, though it has been recorded more widely across Sarawak and Brunei.",
      "altitude": "100-800",
      "field_notes": "Closely related to Nepenthes hirsuta, but with characteristic foliage covered in stiff bristles. The stem is often dark brown, purple or black in colour."
    },
    {
      "id": 51,
      "species": "N. holdenii",
      "img_credit": "Jeremy Holden",
      "img_credit_2": "François Mey",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "həʊldɛni.aɪ",
      "pronunciation_2": "hole-DEN-ee-eye",
      "range": "This species grows in peaty soil on steep ridges in the transition zone between lowland and lower montane evergreen forest.",
      "distribution": "Known only from the Pursat province of western Cambodia.",
      "altitude": "600-800",
      "field_notes": "This species is closely related to the other so-called pyrophyte species from the Indochinese region."
    },
    {
      "id": 52,
      "species": "N. hurrelliana",
      "img_credit": "Jeremiah Harris",
      "img_credit_2": "Richard Ellis",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "hʌˌrɛliˈɑːnə",
      "pronunciation_2": "huh-rel-ee-AHN-er",
      "range": "Mostly grows as an epiphyte in mossy, upper montane forest trees. At high elevations, this species also grows terrestrially, usually amongst scrubby vegetation, often in dense moss.",
      "distribution": "Nepenthes hurrelliana was first observed on the upper slopes of Mount Murud in the Kelabit Highlands of eastern Sarawak. Further populations were discovered across northern Sarawak, Brunei and south-western Sabah.",
      "altitude": "1500-2400",
      "field_notes": "Sometimes confused with Nepenthes fusca and also dismissed as a hybrid of N. fusca with N. veitchii, this species is more widespread than previously thought and reproductively stable. Its origins may well reflect a hybridisation event between the aforementioned species."
    },
    {
      "id": 53,
      "species": "N. inermis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ɪˈnɜrmɪs",
      "pronunciation_2": "ih-NER-miss",
      "range": "At lower elevations, it mostly grows as an epiphyte, perched on the mossy branches of lower montane trees and shrubs. At higher altitudes, it grows on the ground or as an epiphyte, and climbs and scrambles through surrounding upper montane forest and scrub.",
      "distribution": "Nepenthes inermis is known only from the Bukit Barisan range of West Sumatra and Jambi, and is mostly found growing on humid ridge tops and the upper slopes of peaks.",
      "altitude": "1500–2600",
      "field_notes": "Closely related to Nepenthes dubia, this species is readily identifiable by the lack of a peristome."
    },
    {
      "id": 54,
      "species": "N. insignis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alfindra Primaldhi",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "ɪnˈsɪɡnɪs",
      "pronunciation_2": "in-SIG-niss",
      "range": "It grows terrestrially or epiphytically in lowland dipterocarp forest, mossy coastal forest, in scrub, degraded or recovering secondary vegetation and on the mossy banks of rivers and streams. It often grows amidst dense vegetation in dappled shade, usually in areas where humidity is high.",
      "distribution": "Nepenthes insignis occurs in the province of Papua, Western New Guinea, including the nearby island of Biak.",
      "altitude": "0-850",
      "field_notes": "A substantial species that appears to be most closely related to taxa that are otherwise found exclusively in the Philippines."
    },
    {
      "id": 55,
      "species": "N. izumiae",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "iˈzuːmi.aɪ",
      "pronunciation_2": "ih-ZOO-mee-eye",
      "range": "It mainly grows as an epiphyte on the moist, mossy branches of trees, or occasionally in banks of moss on the ground, in upper montane forest, usually in dappled sunlight.",
      "distribution": "Nepenthes izumiae is known only from the upper slopes of two peaks in the Bukit Barisan mountain range, West Sumatra.",
      "altitude": "1700–1900",
      "field_notes": "This plant is closely related to N. singalana, but can be identified by the presence of a basal crest beneath the lid."
    },
    {
      "id": 56,
      "species": "N. jacquelineae",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌdʒækˈlɪni.aɪ",
      "pronunciation_2": "jack-LIN-ee-eye",
      "range": "It grows terrestrially or as an epiphyte in mossy, upper montane forest, usually amongst tall, but sparse, shrubs and trees.",
      "distribution": "Nepenthes jacquelineae is known only from the Bukit Barisan mountain range of West Sumatra.",
      "altitude": "1700-2200",
      "field_notes": "A spectacular and beautiful species that is thought to be related to Nepenthes flava, N. inermis and other strongly infundibular species from Sumatra. It is named after the wife of ecologist Charles Clarke."
    },
    {
      "id": 57,
      "species": "N. jamban",
      "img_credit": "Urs Zimmermann",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˈdʒʌmbʌn",
      "pronunciation_2": "JUM-bun",
      "range": "It grows terrestrially in mossy, upper montane forest and scrub.",
      "distribution": "Nepenthes jamban is known only from the upper slopes of a single mountain in the Bukit Barisan mountain range in North Sumatra.",
      "altitude": "1800-2100",
      "field_notes": "The word 'jamban' means toilet in the Malay language, humourously referring to the extraordinary shape of the pitchers of this species."
    },
    {
      "id": 58,
      "species": "N. kampotiana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "kæmˌpɵtiˈɑːnə",
      "pronunciation_2": "kam-pote-ee-AH-ner",
      "range": "It grows predominantly in clearings amidst sparse trees, shrubs and scrub on low-lying coastal wetlands, or occasionally in open areas on ridge and hill sides.",
      "distribution": "Nepenthes kampotiana is presently known only from the coastal lowlands of southern Cambodia and neighbouring parts of eastern Thailand and western Vietnam. It is also found on Mount Kuap, at the border between Cambodia and Thailand.",
      "altitude": "0–350",
      "field_notes": "One of a number of closely related taxa from Indochina. The differences between this taxon and Nepenthes smilesii are poorly delimited, and it may prove to be synonymous."
    },
    {
      "id": 59,
      "species": "N. kerrii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˈkɛri.aɪ",
      "pronunciation_2": "KEH-ree-eye",
      "range": "It grows in savannah and grassland habitats.",
      "distribution": "Nepenthes kerrii is endemic to Tarutao Marine National Park in southern Thailand.",
      "altitude": "400-500",
      "field_notes": "One of a number of closely related taxa from southernmost Thailand."
    },
    {
      "id": 60,
      "species": "N. khasiana",
      "img_credit": "Brij Kishor Gupta",
      "img_credit_2": "Nagulan Venugopal",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 6,
      "pronunciation_1": "kæsiˈɑːnə",
      "pronunciation_2": "ka-see-AH-ner",
      "range": "It grows terrestrially on sandy, acidic soils at the margins of forests, among recovering secondary vegetation, on bare substrate and scrub on exposed cliffsides, landslide areas and roadside embankments, usually in strong or direct sunlight.",
      "distribution": "The specific epithet refers to the Khasi Hills region of Meghalaya State in north eastern India, to which this species is endemic. Nepenthes khasiana occurs in East Khasi Hills District, the Jarain area of the Jaintia Hills, the Baghmara area of the Garo Hills and West Khasi Hills District, Meghalaya. It is the only pitcher plan that is native to India.",
      "altitude": "500-1500",
      "field_notes": "The only Indian species of Nepenthes, it is severely threatened in its range by development, land clearance and poaching."
    },
    {
      "id": 61,
      "species": "N. klossii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "klɒs'i.aɪ",
      "pronunciation_2": "KLOSS-ee-eye",
      "range": "The population at the Wissel Lake site was small and sparsely scattered, occurring in direct sunlight among stunted scrub and recovering vegetation in lower montane forest.",
      "distribution": "Nepenthes klossii is known only from Papua province, Western New Guinea, where it is recorded from the district of Paniai and the western part of Merauke district. The first collections were made in the latter region, from the lower slopes of Mount Jaya, also called Carstensz Pyramid and the highest peak in Oceania.",
      "altitude": "1000-2000",
      "field_notes": "A close relative of Nepenthes maxima, N. klossii is easily distinguished by its hooded pitcher mouth."
    },
    {
      "id": 62,
      "species": "N. kongkandana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "kɒŋɡˈkændɑːnə",
      "pronunciation_2": "kong-KAN-dar-ner",
      "range": "All the populations of this species that were observed during this study occurred in open areas amidst sparse trees, shrubs and scrub on low-lying coastal plains.",
      "distribution": "Nepenthes kongkandana is known only from southern Thailand, and mainly occurs from the town of Hat Yai in Songkhla province to the Khao Sok National Park in Surat Thani. Small, isolated populations also occur south of Hat Yai.",
      "altitude": "0–50",
      "field_notes": "One of a number of closely related taxa from southernmost Thailand."
    },
    {
      "id": 63,
      "species": "N. lamii",
      "img_credit": "Andreas Wistuba",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 5,
      "pronunciation_1": "ˈlæmi.aɪ",
      "pronunciation_2": "LAM-ee-eye",
      "range": "Nepenthes lamii is a low growing and generally upright shrub. It occurs terrestrially in direct sunlight, amidst exposed, stunted, open scrub and ultramafic rock.",
      "distribution": "Nepenthes lamii is known only from the summit region of one high peak in central Papua province, Western New Guinea. Adjacent peaks attain similar heights, and so it is possible that this species might occur elsewhere.",
      "altitude": "3200-3520",
      "field_notes": "This is the highest growing of all Nepenthes species. The name N. lamii previously included the related N. monticola, a more slender, climbing species found at lower elevations."
    },
    {
      "id": 64,
      "species": "N. lavicola",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌlævɪˈkoʊlə",
      "pronunciation_2": "la-vih-KOLE-er",
      "range": "It grows terrestrially, mainly in stunted, upper montane forest and scrub on open slopes overlying compacted volcanic ash.",
      "distribution": "Nepenthes lavicola is known only from the Geureudong Massif, a stratovolcanic complex consisting of many peaks in the north of Aceh, Sumatra.",
      "altitude": "2000–2600",
      "field_notes": ""
    },
    {
      "id": 65,
      "species": "N. leonardoi",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˌliəˈnɑrdɔɪ",
      "pronunciation_2": "lee-oh-NAR-doh-eye",
      "range": "N. leonardoi grows terrestrially amongst upper montane forest and scrub.",
      "distribution": "Endemic to the upper slopes of Mount Shamkot and the adjoining ridges of the Brow Shoulder massif, Palawan.",
      "altitude": "1300-1490",
      "field_notes": "This species is closely related to Nepenthes deaniana. Its name honours Leonardo Co, a preeminent botanist of the Philippines who was shot dead by government troops in a tragic case of mistaken identity."
    },
    {
      "id": 66,
      "species": "N. lingulata",
      "img_credit": "Urs Zimmermann",
      "img_credit_2": "Alfindra Primaldhi",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "lɪŋɡjuːˈlɑːtə",
      "pronunciation_2": "ling-gyu-LAH-ter",
      "range": "Nepenthes lingulata grows terrestrially and as an epiphyte in mossy, upper montane forest and scrub.",
      "distribution": "Nepenthes lingulata is known only from the upper slopes of one peak in the Bukit Barisan mountain range in North Sumatra.",
      "altitude": "1700-2100",
      "field_notes": "The function of the curious lid appendage after which it is named has not yet been proven empirically, though plausible hypotheses exist."
    },
    {
      "id": 67,
      "species": "N. longifolia",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌlɒŋɡɪˈfoʊli.ə",
      "pronunciation_2": "long-ih-FOE-lee-er",
      "range": "It is found growing in dense lowland or lower montane forest, in tall scrub or amongst recovering secondary vegetation on sandstone slopes and ridges.",
      "distribution": "Nepenthes longifolia is known only from the provinces of West Sumatra and North Sumatra.",
      "altitude": "300–1100",
      "field_notes": ""
    },
    {
      "id": 68,
      "species": "N. lowii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˈloʊ.i.aɪ",
      "pronunciation_2": "LOW-ee-eye",
      "range": "It grows terrestrially or as an epiphyte in mossy, upper montane forest or stunted scrub on mountain summits and ridges where humidity and sunlight are high. At lower elevations, it grows in dappled shade amidst tall, open canopied montane trees and shrubs.",
      "distribution": "Nepenthes lowii occurs widely across Sabah, Sarawak and the interior of Kalimantan.",
      "altitude": "1650-2600",
      "field_notes": "Certainly one of the most beautiful of all Nepenthes, the remarkable shape of this species is allows it to function simultaneously as a feeding post and a toilet for tree shrews."
    },
    {
      "id": 69,
      "species": "N. macfarlanei",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˌmækfɑrˈleɪni.aɪ",
      "pronunciation_2": "mak-far-LANE-ee-eye",
      "range": "It grows mainly in sparse, lower or upper montane forest or scrub on ridge tops and mountain summits.",
      "distribution": "Nepenthes macfarlanei occurs across western Peninsular Malaysia, from Perak to northern Selangor, including the extreme west of Kelantan and Pahang.",
      "altitude": "900–2150",
      "field_notes": "A highly variable, but pretty species that is closely related to Nepenthes gracillima and N. alba."
    },
    {
      "id": 70,
      "species": "N. macrophylla",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌmækrɵˈfɪlə",
      "pronunciation_2": "mak-roe-FILL-er, the pronunciation mak-roe-FILE-er is erroneous as it effectively carries a different meaning",
      "range": "It grows terrestrially or epiphytically in mossy, upper montane forest, either amongst tall trees in dense shade or stunted scrub on the summit where it receives strong or direct sunlight.",
      "distribution": "Nepenthes macrophylla is known with certainty only from the summit of Mount Trus Madi in Sabah.",
      "altitude": "2200–2642",
      "field_notes": "A remarkable, large leaved taxon with striking pitchers. It is believed to be closely allied to Nepenthes edwardsiana."
    },
    {
      "id": 71,
      "species": "N. macrovulgaris",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌmækrɵvʌlˈɡɛərɨs",
      "pronunciation_2": "mak-roe-vul-GERR-iss or mak-roe-vul-GAH-riss",
      "range": "It grows terrestrially in clearings amongst lowland dipterocarp or lower montane forest, stunted scrub, grassland vegetation or in open, exposed areas such as upon landslides. It grows in dappled shade as well as strong or direct sunlight.",
      "distribution": "Nepenthes macrovulgaris is known only from ultramafic sites in Sabah, including Mount Kinabalu, Mount Silam, Mount Nambuyukon (a neighbouring peak close to Mount Tambuyukon), the Danum Valley and the Maliau and Tawai Ranges.",
      "altitude": "300-1200",
      "field_notes": "This is a generally robust species that favours open areas with excellent illumination."
    },
    {
      "id": 72,
      "species": "N. madagascariensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 6,
      "pronunciation_1": "mædəˌɡæskɑriˈɛnsɪs",
      "pronunciation_2": "ma-duh-gas-ka-ree-EN-sis",
      "range": "It grows terrestrially, usually in strong or direct sunlight and occurs in Sphagnum wetlands, pear bogs, the margins of coastal mangrove forests, in clearings in lowland forests, among recovering secondary vegetation, and on bare substrate in scrub on exposed cliffsides, landslised areas and roadside embankments.",
      "distribution": "Nepenthes madagascariensis is restricted to a narrow coastal stretch of eatern Madagascar from Maroansetra (the Masoala Peninsula) to Taolagnaro (Fort Dauphin) in the south of the island.",
      "altitude": "0-500",
      "field_notes": ""
    },
    {
      "id": 73,
      "species": "N. mantalingajanensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "mæntəˌlɪŋɡəhɑːˈnɛnsɪs",
      "pronunciation_2": "man-ter-ling-ger-han-EN-sis",
      "range": "Nepenthes mantalingajanensis grows primarily amidst stunted, upper montane forest and scrub.",
      "distribution": "Nepenthes mantalingajanensis is presently known only from the upper slopes of Mount Mantalingahan.",
      "altitude": "1700",
      "field_notes": "First collected by George Argent in 1992, it was not until 1998 that this taxon was finally described by Andreas Wistuba."
    },
    {
      "id": 74,
      "species": "N. mapuluensis",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "məˌpuːluːˈɛnsɪs",
      "pronunciation_2": "mer-poo-loo-EN-sis",
      "range": "It grows on eroded ledges and in crevices, or rooted directly to the cliffsides wherever scant substrate accumulates and a roothold can be gained. In such habitat, N. mapuluensis grows mostly in direct sunlight or light shade amidst scant, scrubby vegetation.",
      "distribution": "The specific epithet refers to Mount Ilas Mapulu, a remote limestone outcrop in the Sambaliung Range, East Kalimantan, where this species was discovered in 1957. Fires swept across Ilas Mapulu during the early 1990s, destroying the native flora, and it was feared that N. mapuluensis might be extinct in the wild. Since then, populations of this species have been discovered growing on other peaks in the Sangkulirang Range.",
      "altitude": "700–800",
      "field_notes": ""
    },
    {
      "id": 75,
      "species": "N. masoalensis",
      "img_credit": "Eric Schlosser",
      "img_credit_2": "Eric Schlosser",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 6,
      "pronunciation_1": "ˌmæsɵəˈlɛnsɪs",
      "pronunciation_2": "mah-so-er-LEN-sis",
      "range": "It grows terrestrially, mainly in open, sunny clearings in lowland forests, Pandanus and Sphagnum swamps, and amidst scrub on ridge sides and ridge tops.",
      "distribution": "The specific epithet denotes that this species grows endemically along the coast of the Masoala peninsula in the north east of Madagascar.",
      "altitude": "0-400",
      "field_notes": ""
    },
    {
      "id": 76,
      "species": "N. maxima",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": "4,5",
      "pronunciation_1": "ˈmæksɨmə",
      "pronunciation_2": "max-imm-er",
      "range": "It grows terrestrially or epiphytically in heath forest, degraded or recovering secondary vegetation, lowland dipterocarp forest, on the banks of rivers and water courses, on bare substrate on exposed cliffsides and landslide areas, and in lower and upper montane forest on ridges and mountain summits.",
      "distribution": "Nepenthes maxima is widely distributed across Sulawesi, the Maluku Islands and New Guinea (both Western New Guinea and Papua New Guinea).",
      "altitude": "600-2600",
      "field_notes": "This species is bewilderingly variable across its range, with dwarf forms, giant forms and various colour forms recognised."
    },
    {
      "id": 77,
      "species": "N. merrilliana",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "mɛˌrɪliˈɑːnə",
      "pronunciation_2": "merr-ill-ee-AHN-er",
      "range": "Nepenthes merrilliana grows terrestrially in lowland heath forest, degraded or recovering secondary vegetation, logged lowland dipterocarp forest, on exposed, inland cliff and landslide areas, and in stunted, lower montane forest. It also grows on the margins of mangrove dipterocarp forests, sometimes close to brackish water, and even on the limestone cliffs of minor offshore islands along the Surigao peninsula, where it may flourish just a few meters above coral reefs of the Pacific Ocean.",
      "distribution": "Nepenthes merrilliana is widespread across Dinagat and northern and central Mindanao.",
      "altitude": "0–900",
      "field_notes": "This species is amongst the largest of Nepenthes, occasional plants producing pitchers that rival those of the montane giants of Borneo and Palawan in size."
    },
    {
      "id": 78,
      "species": "N. micramphora",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "maɪkræmfɔərə",
      "pronunciation_2": "mike-RAM-fora",
      "range": "It grows terrestrially amidst sparse, open canopied, mossy, upper montane trees, amongst degraded or recovering secondary vegetation, on exposed cliffsides and landslide areas, and on stunted scrub on ridge tops.",
      "distribution": "Nepenthes micramphora is presently known only from the upper slopes of Mount Hamiguitan in southern Mindanao.",
      "altitude": "1000",
      "field_notes": "One of the smallest of all Nepenthes, rivalled only by Nepenthes argentii. That species has more robust stems and leaves, but these are much shorter, and smaller pitchers."
    },
    {
      "id": 79,
      "species": "N. mikei",
      "img_credit": "Alfindra Primaldhi",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 2,
      "pronunciation_1": "ˈmɪki.aɪ",
      "pronunciation_2": "MICK-ee-eye or MIKE-ee-eye",
      "range": "It occurs amidst lower and upper montane forest and scrub on exposed, open ridges, cliffsides and mountain summits.",
      "distribution": "Nepenthes mikei is known from only two mountains, namely Mount Pangulubao, in North Sumatra, and Mount Bandahara, in Aceh.",
      "altitude": "1100–2800",
      "field_notes": ""
    },
    {
      "id": 80,
      "species": "N. mindanaoensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˌmɪndənaʊˈɛnsɪs",
      "pronunciation_2": "min-der-now-EN-sis",
      "range": "It grows terrestrially in lowland heath forest, degraded or recovering secondary vegetation, on exposed cliffsides and landslide areas, in clearings in lowland dipterocarp forest and in lower montane forest, particularly on ridges and summits.",
      "distribution": "Nepenthes mindanaoensis is widespread across Dinagat and northern and central Mindanao.",
      "altitude": "0–800",
      "field_notes": ""
    },
    {
      "id": 81,
      "species": "N. mira",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˈmiːrə",
      "pronunciation_2": "MEER-er",
      "range": "N. mira occurs on sandstone in dense, upper montane forest and scrub, often in heavy shade, but also occasionally in strong or direct sunlight.",
      "distribution": "Nepenthes mira is known only from the summit of Mount Cleopatra (Cleopatra’s Needle), in Palawan.",
      "altitude": "1550",
      "field_notes": "This species is closely related to Nepenthes deaniana."
    },
    {
      "id": 82,
      "species": "N. mirabilis",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": "1,2,3,4,5,6,7",
      "pronunciation_1": "mɪˈræbɨlɪs",
      "pronunciation_2": "mih-RAB-illis or MIH-rer-billis",
      "range": "Across this vast geographic area, N. mirabilis is found growing in a wide range of habitats; these include lowland peat forest and the margins of lowland dipterocarp forest, patches of exposed bare substrate on degraded land, the edges of mangrove forests and even the margins of padi fields and seasonally inundated swamps. It is especially common in recovering secondary forest, and grows commonly among scrub and ferns of the genus Gleichenia. In Micronesia, N. mirabilis grows widely on limestone cliffsides, a few metres above coral seas, and in Cape York, it occurs mainly along the banks of streams and rivers, perhaps due to the severity of the dry season in that part of Australia. That N. mirabilis populates such a wide variety of different habitat-types and niches may serve to partly explain the wide distribution of this species.",
      "distribution": "Nepenthes mirabilis has the widest distribution of all Nepenthes. It is found in continental Southeast Asia from the south of China (Guangdong province, Hong Kong and Macau), through Indochina (across Laos, Cambodia, Thailand, Myanmar) to the south of Peninsular Malaysia. Its range continues across the Sunda Islands (Sumatra, Java, Borneo, Sulawesi), to the Philippines (Mindanao and Dinagat) and many small islands as far east as the remote Caroline Islands of Micronesia (Palau and Yap). It is absent across the Lesser Sunda Islands where conditions are too dry, but it is present on the Maluku Islands, New Guinea (including the Louisiade archipelago) and the northeast of Queensland, Australia.",
      "altitude": "0-1500",
      "field_notes": ""
    },
    {
      "id": 83,
      "species": "N. monticola",
      "img_credit": "Alfindra Primaldhi",
      "img_credit_2": "Alfindra Primaldhi",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "mɒntɪkoʊlə",
      "pronunciation_2": "mon-tih-KOLE-er",
      "range": "Nepenthes monticola is a terrestrial, occasionally epiphytic, strongly climbing vine that favours bright conditions amongst stunted, mossy, upper montane vegetation.",
      "distribution": "Nepenthes monticola is known from the higher mountains of the west central highlands of Papua Province, West Papua, Indonesia, on the island of New Guinea.",
      "altitude": "1400-2620",
      "field_notes": "Formerly misdiagnosed within N. lamii, this species occupies a different ecological niche and, whilst apparently related, is impossible to confuse with the aforementioned species given its different dimensions and proportions."
    },
    {
      "id": 84,
      "species": "N. muluensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌmʊluːˈɛnsɪs",
      "pronunciation_2": "moo-loo-EN-sis",
      "range": "Nepenthes muluensis predominantly occurs in upper montane forest and scrub on ridge tops and mountain summits.",
      "distribution": "Nepenthes muluensis is known only from the upper slopes of Mount Mulu, Mount Murud and also Bukit Batu Lawi in Sarawak.",
      "altitude": "1700- 2400",
      "field_notes": "On the summits where it occurs, this species may festoon the local vegetation, putting on some of the prettiest displays of all Nepenthes species."
    },
    {
      "id": 85,
      "species": "N. murudensis",
      "img_credit": "Jeremiah Harris",
      "img_credit_2": "Richard Ellis",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌmʊrʊˈdɛnsɨs",
      "pronunciation_2": "muh-ruhd-EN-sis",
      "range": "Nepenthes murudensis grows among mossy upper montane trees, shrubs and summit scrub.",
      "distribution": "Endemic to Mount Murud, in the Kelabit\nHighlands of Sarawak.",
      "altitude": "2000-2423",
      "field_notes": "Once believed to be a giant form of Nepenthes tentaculata (which also exist), this species has been shown to be distinct."
    },
    {
      "id": 86,
      "species": "N. naga",
      "img_credit": "Alfindra Primaldhi",
      "img_credit_2": "Alfindra Primaldhi",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "nɑːgə",
      "pronunciation_2": "NAR-ger",
      "range": "Nepenthes naga grows terrestrially and as an epiphyte in mossy, upper montane forest and scrub.",
      "distribution": "Nepenthes naga is known only from the upper slopes of one peak in the Bukit Barisan mountain range in North Sumatra.",
      "altitude": "1500-2000",
      "field_notes": "Though generally regarded as a synonym amongst authorities, this taxon has not yet been formally reduced in rank."
    },
    {
      "id": 87,
      "species": "N. neoguineensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "ˌniːoʊˌɡɪniːˈɛnsɪs",
      "pronunciation_2": "nee-oh-gwin-ee-EN-sis",
      "range": "Nepenthes neoguineensis grows terrestrially in heath forest, degraded or recovering secondary vegetation, logged lowland dipterocarp forest, on exposed cliffsides, landslide areas and roadside embankments, along the banks of rivers, on ridge tops and in open grassland.",
      "distribution": "Nepenthes neoguineensis occurs across New Guinea (both Western New Guinea and Papua New Guinea), on the near lying D’Entrecasteaux Islands.",
      "altitude": "0–900",
      "field_notes": ""
    },
    {
      "id": 88,
      "species": "N. nigra",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 4,
      "pronunciation_1": "niːgrə",
      "pronunciation_2": "nee-grer",
      "range": "Nepenthes nigra occurs in mossy montane forest, montane scrub and in small open clearings and on cliff sides.",
      "distribution": "Nepenthes nigra has been recently observed on Mount Tenamatua, Mount Katopasa, Mount Rantemario, Mount Kautimbu, Mount Tambusisi, Mount Sesean and on Mount Nokilalaki.",
      "altitude": "1500-2700",
      "field_notes": "Though related to Nepenthes tentaculata, the leaves, stems and pitchers of this species differ appreciably. It is likely that this species was not described until field studies revealed its form; herbarium specimens often appear similar as detail is lost in the flattening and drying of plant material."
    },
    {
      "id": 89,
      "species": "N. northiana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "nɔrθiˈɑːnə",
      "pronunciation_2": "north-ee-AHN-er",
      "range": "It grows on eroded ledges and crevices or rooted directly to the cliffsides wherever a roothold can be maintained. In such habitat, N. northiana mostly grows exposed to direct sunlight or sometimes amidst scant, scrubby vegetation in light shade.",
      "distribution": "Nepenthes northiana is endemic to the Kuching Division of Sarawak and is best known from the limestone outcrops and hills close to the village of Bau, south of Kuching.",
      "altitude": "0–500",
      "field_notes": "This spectacular species is at risk of extinction in the wild due to unscrupulous collection of wild plants."
    },
    {
      "id": 90,
      "species": "N. ovata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "oʊˈvɑːtə",
      "pronunciation_2": "oh-VAH-ter",
      "range": "It grows terrestrially or as an epiphyte in mossy, upper montane forest on ridges and mountain summits, usually in strong or direct sunlight.",
      "distribution": "Nepenthes ovata is known only from the highlands of North Sumatra and has been observed on Mount Pangulubao and nearby peaks surrounding Lake Toba.",
      "altitude": "1700–2100",
      "field_notes": ""
    },
    {
      "id": 91,
      "species": "N. palawanensis",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˌpæləwənˈɛnsɪs",
      "pronunciation_2": "pal-ah-wah-NEN-sis",
      "range": "It grows terrestrially among upper montane scrub.",
      "distribution": "Nepenthes palawanensis is endemic of the island of Palawan and has been observed on the summit and summit ridge of Sultan Peak.",
      "altitude": "1100–1236",
      "field_notes": "One of the largest species of Nepenthes, and one that is closely related to N. attenboroughii, which occurs on an adjacent mountain."
    },
    {
      "id": 92,
      "species": "N. paniculata",
      "img_credit": "Steve Rose",
      "img_credit_2": "Steve Rose",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "ˌpænɨkjuːˈlɑːtə",
      "pronunciation_2": "pan-ick-you-LAH-ter",
      "range": "This species is found growing in ridge-side mossy forest.",
      "distribution": "The Dutch botanist, Herman Lam, discovered N. paniculata in 1920 on a narrow ridge leading to the summit of Doorman Top, also called Doorman Peak. The species was rediscovered in August 2013 by a team of naturalists following a number of previously unsuccessful expeditions to locate it.",
      "altitude": "1460",
      "field_notes": "This species appears to be related to Nepenthes insignis, and by extension to closely allied taxa in the Philippines."
    },
    {
      "id": 93,
      "species": "N. papuana",
      "img_credit": "Joachim Nerz",
      "img_credit_2": "Alfindra Primaldhi",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "ˌpæpuːˈɑːnə",
      "pronunciation_2": "pa-poo-AHN-er",
      "range": "It grows terrestrially in heath forest among degraded or recovering secondary vegetation, in logged lowland dipterocarp forest and on the edge of lower montane forests.",
      "distribution": "Nepenthes papuana is known only from Papua province, Western New Guinea, with no records from Papua New Guinea thus far.",
      "altitude": "0-1300",
      "field_notes": ""
    },
    {
      "id": 94,
      "species": "N. peltata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "pɛltɑːtə",
      "pronunciation_2": "pell-TAH-ter",
      "range": "It grows terrestrially in mossy, upper montane forest, amongst degraded or recovering secondary vegetation, on exposed cliffsides and landslide areas, and alongside stunted scrub on ridge tops.",
      "distribution": "Nepenthes peltata is presently known only from the upper slopes of Mount Hamiguitan in Mindanao.",
      "altitude": "865",
      "field_notes": "This species appears to be most closely related to species from Palawan and Borneo, with which it shares a number of common characteristics."
    },
    {
      "id": 95,
      "species": "N. pervillei",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 6,
      "pronunciation_1": "pərˈvɪli.aɪ",
      "pronunciation_2": "per-VILL-ee-eye",
      "range": "It mainly grows amidst dense but low growing scrub on granitic outcrops and hillsides, usually in strong or direct sunlight.",
      "distribution": "Nepenthes pervillei is endemic to the Seychelles and best known from the beautiful islands of Mahé and Silhouette.",
      "altitude": "350-750",
      "field_notes": ""
    },
    {
      "id": 96,
      "species": "N. petiolata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "ˌpiːti.ɵˈlɑːtə",
      "pronunciation_2": "pee-tee-oh-LAH-ter",
      "range": "It grows terrestrially or as an epiphyte in mossy, upper montane forest and scrub on the upper slopes of mountains, especially along ridge tops and summits, usually in strong or direct sunlight.",
      "distribution": "Nepenthes petiolata is presently known only from the Mabaho Range and the Diuata Mountains in northern Mindanao, occurring widely on the summits of Mount Hilong Hilong (also spelt Ilong Ilong) and Mount Masay (previously known as Mount Urdaneta).",
      "altitude": "1450-1900",
      "field_notes": ""
    },
    {
      "id": 97,
      "species": "N. philippinensis",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "fɪˌlɪpɨˈnɛnsɪs",
      "pronunciation_2": "fih-lih-pin-EN-sis",
      "range": "It grows terrestrially, usually in strong or direct sunlight, in lowland heath forest, amongst degraded or recovering secondary vegetation, in logged lowland dipterocarp forest, on the banks of rivers and water courses, and also on exposed cliffsides, landslide areas and roadside embankments.",
      "distribution": "This species is known only from the island of Palawan.",
      "altitude": "0-600",
      "field_notes": ""
    },
    {
      "id": 98,
      "species": "N. pilosa",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "paɪˈloʊzə",
      "pronunciation_2": "pie-LOW-zer",
      "range": "It grows in open, humid, upper montane forest in rich, wet, mossy substrate consisting of humus and leaf litter, mostly in dappled shade, or less often beneath strong or direct sunlight.",
      "distribution": "Nepenthes pilosa was first encountered in 1899 on Bukit Batu Lesung (or locally, Gunung Bantempel), a remote ridge in the mountainous interior of Kalimantan. During the 20th century, populations of a Nepenthes taxon were discovered in the north west of Borneo, especially across the Crocker Range in Sabah.",
      "altitude": "1600",
      "field_notes": ""
    },
    {
      "id": 99,
      "species": "N. pitopangii",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 4,
      "pronunciation_1": "pɪtɵˈpæŋɡiːaɪ",
      "pronunciation_2": "pih-toe-PANG-ghee-eye",
      "range": "At the only known locality, this plant occurs in secondary, recovering vegetation in submontane forest.",
      "distribution": "Only one specimen of N. pitopangii has been discovered so far. It grows in the Lore Lindu National Park in Central Sulawesi.",
      "altitude": "1800",
      "field_notes": ""
    },
    {
      "id": 100,
      "species": "N. platychila",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 3,
      "pronunciation_1": "ˌplætɨˈkaɪlə",
      "pronunciation_2": "pla-tee-CHI-ler",
      "range": "It grows as an epiphyte in mossy lower montane forest and on the ground amidst sparse vegetation on rocky outcrops and steep sandstone slopes and ridge sides.",
      "distribution": "Nepenthes platychila is known only from the Hose Mountains of Sarawak and has been observed on Bukit Batu and Bukit Sindap.",
      "altitude": "900-1400",
      "field_notes": ""
    },
    {
      "id": 101,
      "species": "N. pulchra",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "pʊlkrə",
      "pronunciation_2": "PULL-krer",
      "range": "It grows terrestrially on ultramafic soils in clearings and in open upper montane scrub.",
      "distribution": "This species is presently known only from Mount Kiamo.",
      "altitude": "1300–1800",
      "field_notes": ""
    },
    {
      "id": 102,
      "species": "N. rafflesiana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": "1,2,3",
      "pronunciation_1": "ræˌfliːziˈɑːnə",
      "pronunciation_2": "ra-fleas-ee-AHN-er",
      "range": "It is an extremely versatile species and is found in a wide range of habitats, including coastal heath forests, peat swamp forests, degraded or recovering secondary vegetation and the margins of mangroves and lowland dipterocarp forests. It also is observed growing on bare terrain in exposed areas, on recently cleared habitat, or on coastal cliffsides. It also tolerates a range of substrates, and is found growing in laterite, pure sand, clay, peat and humus.",
      "distribution": "Nepenthes raf!esiana is distributed across Borneo, particularly in Sabah, Sarawak and Brunei. It has a patchy distribution across the south east of Peninsular Malaysia and also occurs in Singapore and across the Riau Archipelago. It does occur in the northern half of Sumatra, but is uncommon on that island and found mainly on the north west coast.",
      "altitude": "0–1200",
      "field_notes": ""
    },
    {
      "id": 103,
      "species": "N. rajah",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˈrɑːdʒə",
      "pronunciation_2": "RAH-jer",
      "range": "It occurs on serpentine substrate, amidst scrubby, low growing, upper montane vegetation, usually in direct or bright sunlight.",
      "distribution": "Nepenthes rajah is known to occur at only four locations, three of which lie on the upper slopes of Mount Kinabalu, at Mesilau, on the Marai Parai spur, and below the Paka cave. The remaining wild population occurs on the summit of neighbouring Mount Tambuyukon.",
      "altitude": "1500-2650",
      "field_notes": ""
    },
    {
      "id": 104,
      "species": "N. ramispina",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˌræmɨˈspaɪnə",
      "pronunciation_2": "ram-iss-PINE-er",
      "range": "It occurs mainly in sparse lower or upper montane forest or scrub on ridge tops and mountain summits, or on mossy slopes and cliff sides amidst recovering, secondary vegetation.",
      "distribution": "Nepenthes ramispina is endemic to Peninsular Malaysia and occurs across the Titiwangsa Mountains of Negeri Sembilan, Selangor, Pahang, Perak and Kelantan.",
      "altitude": "900–2000",
      "field_notes": ""
    },
    {
      "id": 105,
      "species": "N. reinwardtiana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": "2,3",
      "pronunciation_1": "ˌraɪnwɔrtiˈɑːnə",
      "pronunciation_2": "rhine-ward-tee-AHN-er",
      "range": "At lower elevations, it grows terrestrially in heath forest, among degraded or recovering secondary forest, logged lowland dipterocarp forest, and also on the bare face of exposed cliffs, landslides and roadside embankments.",
      "distribution": "Nepenthes reinwardtiana is widely distributed across Borneo and western Sumatra (especially across the Barisan mountain range and the lowlands of the west coast).",
      "altitude": "0-2200",
      "field_notes": ""
    },
    {
      "id": 106,
      "species": "N. rhombicaulis",
      "img_credit": "Ma Suska",
      "img_credit_2": "Alfindra Primaldhi",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌrɒmbɨˈkɔːlɪs",
      "pronunciation_2": "rom-bih-CALL-iss",
      "range": "Nepenthes rhombicaulis grows terrestrially generally in shady, mossy, montane forest on steep slopes, ridge tops or mountain summits.",
      "distribution": "Nepenthes rhombicaulis occurs across the highlands of North Sumatra and is best known from the upper slopes of Mount Lubukraya, the Pangulubao Massif and nearby peaks surrounding Lake Toba.",
      "altitude": "1600–2000",
      "field_notes": ""
    },
    {
      "id": 107,
      "species": "N. rigidifolia",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌrɪdʒɪdɨˈfoʊliə",
      "pronunciation_2": "rih-jih-dih-FOE-lee-er",
      "range": "Nepenthes rigidifolia grows terrestrially in montane forest and scrub.",
      "distribution": "Nepenthes rigidifolia is known only from one small population near Sidikalang in the Karo Regency, North Sumatra.",
      "altitude": "1000–1600",
      "field_notes": ""
    },
    {
      "id": 108,
      "species": "N. robcantleyi",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Rob Cantley",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "rɒbkæntli.aɪ",
      "pronunciation_2": "rob-KANT-lee-eye",
      "range": "It grows terrestrially, but may possibly also occur as an epiphyte.",
      "distribution": "Nepenthes robcantleyi is currently known from just one location in submontane evergreen forest in Mindanao, Philippine.",
      "altitude": "1800",
      "field_notes": ""
    },
    {
      "id": 109,
      "species": "N. rowanae",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "ˈroʊ.əniː",
      "pronunciation_2": "row-ER-nigh or roh-WAN-eye",
      "range": "It grows amidst sparese, low growing marsh grasses and scrub.",
      "distribution": "Nepenthes rowanae is endemic to the Cape York Peninsula of Queensland, northern Australia, and occurs in seasonally inundated swamplands along and around the Jardine River.",
      "altitude": "0-80",
      "field_notes": ""
    },
    {
      "id": 110,
      "species": "N. sanguinea",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Jan Flisek",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "sæŋˈɡwɪneɪə",
      "pronunciation_2": "sang-GWIN-ay-er or sang-GWIN-ee-er",
      "range": "It is mostly found growing in lower and upper montane forest and scrub on ridge tops and mountain summits, or on mossy slopes and cliff sides amidst recovering, secondary vegetation.",
      "distribution": "Nepenthes sanguinea is widely distributed across the mountainous interior of Peninsular Malaysia and the extreme south of Thailand.",
      "altitude": "300–1800",
      "field_notes": ""
    },
    {
      "id": 111,
      "species": "N. saranganiensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "sɑrɑːŋˌɡɑːniˈɛnsɨs",
      "pronunciation_2": "sa-rang-gan-ee-EN-sis",
      "range": "Nepenthes saranganiensis grows strictly as an epiphyte on the mossy branches of tall, lower montane trees. To date, it has only been observed growing near ground level on recently fallen trees and branches.",
      "distribution": "Kitanglad Range in central Mindanao.",
      "altitude": "1800–2100",
      "field_notes": ""
    },
    {
      "id": 112,
      "species": "N. sibuyanensis",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "sɪˈbʊjənɛnsɪs",
      "pronunciation_2": "sih-boo-yan-EN-sis",
      "range": "Plants occur amidst severely exposed, windswept and stunted, upper montane scrub.",
      "distribution": "Nepenthes sibuyanensis is known only from Sibuyan Island. It is found on the upper slopes of Mount Guiting–Guiting and adjacent Mount Mayo, as well as on the connecting ridge between these mountains.",
      "altitude": "1250-1500",
      "field_notes": ""
    },
    {
      "id": 113,
      "species": "N. singalana",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "sɪŋɡəˈleɪnə",
      "pronunciation_2": "sing-ger-LAH-ner",
      "range": "It grows terrestrially and epiphytically in dappled shade or direct sunlight.",
      "distribution": "Nepenthes singalana is known from West Sumatra and Jambi province.",
      "altitude": "2000–2900",
      "field_notes": ""
    },
    {
      "id": 114,
      "species": "N. smilesii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "ˈsmaɪlzi.aɪ or smaɪˈliːzi.aɪ",
      "pronunciation_2": "smiles-EE-eye or smile-EEZ-ee-eye",
      "range": "Nepenthes smilesii is found growing in a very wide range of habitats, including lowland plains, amidst sparse stunted, lower montane forest, bamboo forest, highland savannah and on the margins of highland pine forests. It often grows in pure sand, mostly in open areas exposed to strong or direct sunlight.",
      "distribution": "The species occurs widely across north-east Thailand, southern Laos and possibly also western Vietnam.",
      "altitude": "200–1500",
      "field_notes": ""
    },
    {
      "id": 115,
      "species": "N. spathulata",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˌspæθjuːˈlɑːtə",
      "pronunciation_2": "spath-you-LAH-ter",
      "range": "It grows in humid, mossy, lower or upper montane forest, especially on ridges and mountain summits, usually in strong or direct sunlight. At lower elevations, it grows predominantly as an epiphyte, whereas at higher altitudes it is mainly terrestrial.",
      "distribution": "Nepenthes spathulata occurs widely across the highlands of Jambi, South Sumatra, Bengkulu and Lampung, but its distribution is patchy.",
      "altitude": "1100-2900",
      "field_notes": ""
    },
    {
      "id": 116,
      "species": "N. spectabilis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "spɛktəˈbɨlɪs",
      "pronunciation_2": "speck-ter-BIH-lis or speck-TAB-ilis",
      "range": "It grows terrestrially or epiphytically in mossy, lower and upper montane forest, amidst tall shrubs and trees in dappled shade, or amidst sparse scrub or in exposed, open areas in strong or direct sunlight.",
      "distribution": "Nepenthes spectabilis is known only from North Sumatra and Aceh, mainly across the highlands between Lake Toba and Mount Kemiri.",
      "altitude": "1400–2200",
      "field_notes": ""
    },
    {
      "id": 117,
      "species": "N. stenophylla",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˌstɛnɵˈfɪlə",
      "pronunciation_2": "sten-oh-FILL-er or sten-OFF-filler, the pronunciation sten-oh-FILE-er is erroneous as it effectively carries a different meaning",
      "range": "It grows on the ground or as an epiphyte, mostly in stunted heath forest, secondary forest, montane forest, and scrub on ridge tops and mountain summits, usually in direct or strong sunlight.",
      "distribution": "Nepenthes stenophylla is endemic to Borneo and found across Sabah and the interiors of Sarawak and Kalimantan.",
      "altitude": "800-2600",
      "field_notes": ""
    },
    {
      "id": 118,
      "species": "N. sumatrana",
      "img_credit": "Ch'ien Lee",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 2,
      "pronunciation_1": "sʊmɑːˈtreɪnə",
      "pronunciation_2": "soo-muh-TRAH-ner",
      "range": "It grows in humid, undisturbed lowland dipterocarp forest on steep cliffsides and the slopes of hills and ridges. It usually grows amidst shrubs and trees in dappled shade.",
      "distribution": "The distribution range of this species is poorly understood, but it is known to occur in the hills to the east of Sibolga, in North Sumatra, and near Sawahlunto in West Sumatra.",
      "altitude": "0–800",
      "field_notes": ""
    },
    {
      "id": 119,
      "species": "N. suratensis",
      "img_credit": "Marcello Catalano",
      "img_credit_2": "Marcello Catalano",
      "pitcher_type": "lower",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "suːrætɛnsɪs",
      "pronunciation_2": "soo-rat-EN-sis",
      "range": "It grows in sandy soil on open savannah and grassland close to sea level.",
      "distribution": "Nepenthes suratensis is endemic to the coastal regions of Surat Thani Province, Thailand.",
      "altitude": "0-200",
      "field_notes": ""
    },
    {
      "id": 120,
      "species": "N. surigaoensis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "suːrɪgaʊɛnsɪs",
      "pronunciation_2": "soo-rih-GOW-en-sis",
      "range": "Nepenthes surigaoensis is associated with shady, lower montane forest; all known populations occur on mountain ridges amidst dense vegetation.",
      "distribution": "Surigao Peninsula in northern Mindanao. This species known from the higher slopes of the Mount Masay massif in the Mabaho Range in northern Mindanao, as well as a minor peak of the Pantaron Range in central Mindanao",
      "altitude": "800-1200",
      "field_notes": ""
    },
    {
      "id": 121,
      "species": "N. talangensis",
      "img_credit": "Richard Ellis",
      "img_credit_2": "Richard Ellis",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "tɑːlɑːŋˈɛnsɪs",
      "pronunciation_2": "ta-lang-EN-sis",
      "range": "It grows terrestrially or very occasionally as an epiphyte in mossy, upper montane forest, amidst tall shrubs and trees in dappled shade, or amidst sparse scrub in exposed areas beneath strong or direct sunlight.",
      "distribution": "Nepenthes talangensis occurs on the upper slopes of Mount Talang in West Sumatra.",
      "altitude": "1800–2500",
      "field_notes": ""
    },
    {
      "id": 122,
      "species": "N. tenax",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 5,
      "pronunciation_1": "ˈtɛnæks",
      "pronunciation_2": "TEN-axe",
      "range": "All known populations of Nepenthes tenax occur amidst sparse, low growing marsh grasses and scrub, usually in direct sunlight in wet substrate.",
      "distribution": "Nepenthes tenax is endemic to the Cape York Peninsula of Queensland, northern Australia.",
      "altitude": "0-80",
      "field_notes": ""
    },
    {
      "id": 123,
      "species": "N. tentaculata",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Greg Bourke",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "tɛnˌtækjuːˈlɑːtə",
      "pronunciation_2": "ten-tak-you-LAH-ter",
      "range": "It grows terrestrially or occasionally as an epiphyte, usually in peat swamp forest, mossy upper montane forest and stunted scrub on ridge tops and mountain summits. Although it favours high humidity and strong or direct sunlight, it is also tolerant of shade and occurring in close-canopied, lower montane forest, though such populations are generally sparse and less vigorous.",
      "distribution": "Nepenthes tentaculata is one of the most successful and widely distributed of all highland Nepenthes, and occurs across Borneo on virtually every peak above 1000 m and also across Sulawesi, though its distribution on that island is patchy and less well documented.",
      "altitude": "700-2550",
      "field_notes": ""
    },
    {
      "id": 124,
      "species": "N. tenuis",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "ˈtɛnjuːɪs",
      "pronunciation_2": "TEN-you-iss",
      "range": "Nepenthes tenuis grows on ridge tops and mountain summits. It is mainly found growing on moist banks of moss or leaf litter, usually in dappled shade amidst tall, but sparse montane vegetation.",
      "distribution": "Tjampo River region of West Sumatra.",
      "altitude": "1000-1200",
      "field_notes": ""
    },
    {
      "id": 125,
      "species": "N. thai",
      "img_credit": "Marcello Catalano",
      "img_credit_2": "Marcello Catalano",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "taɪ",
      "pronunciation_2": "tie or thigh",
      "range": "Nepenthes thai has only been collected from limestone habitats, where it gros in leaf litter overlying limstone rock.",
      "distribution": "Nepenthes thai is known from the mountains of Narathiwat Province, Thailand, which borders with Malaysia, to the south. It has been located on three peaks that lie within Hala-Bala National Park.",
      "altitude": "500-600",
      "field_notes": ""
    },
    {
      "id": 126,
      "species": "N. thorelii",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 1,
      "pronunciation_1": "θɒˈrɛli.aɪ",
      "pronunciation_2": "thor-RELL-ee-eye",
      "range": "It grows terrestrially on acidic, riverine silt.",
      "distribution": "Nepenthes thorelii is known from only one site in Vietnam. It is highly localised and has been extirpated from all previously known habitats in Vietnam and Cambodia by poaching.",
      "altitude": "10-20",
      "field_notes": ""
    },
    {
      "id": 127,
      "species": "N. tobaica",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 2,
      "pronunciation_1": "toʊˈbaɪkə",
      "pronunciation_2": "toe-BAKE-er",
      "range": "It grows terrestrially in sparse, open, low growing vegetation in heath forest, among recovering secondary vegetation, and on exposed hillsides, cliff faces, landslide areas and roadside embankments. It usually grows in strong or direct sunlight, often in substrates that can become seasonally dry.",
      "distribution": "Nepenthes tobaica is widespread from the Gayo Lands of Aceh to Tatutung (40 km north-east of Sibolga) in North Sumatra, and is particularly common around Lake Toba. Outlying populations of N. tobaica occur as far south as Lake Kerinci in Jambi province.",
      "altitude": "380–1800",
      "field_notes": ""
    },
    {
      "id": 128,
      "species": "N. tomoriana",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Ch'ien Lee",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": "4,5",
      "pronunciation_1": "təmɒriˈɑːnə",
      "pronunciation_2": "ter-more-ee-AHN-er",
      "range": "It grows terrestrially in heath forest, degraded or recovering secondary vegetation, on the margins of lowland dipterocarp forest, mangrove swamps, and on exposed cliffsides and landslide areas.",
      "distribution": "Nepenthes tomoriana is recorded from the coastal region surrounding Kolonodale, to the south of the East Peninsula in Central Sulawesi, where it often occurs on ultramafic soils.",
      "altitude": "0–500",
      "field_notes": ""
    },
    {
      "id": 129,
      "species": "N. treubiana",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 5,
      "pronunciation_1": "trɔɪbiˈɑːnə",
      "pronunciation_2": "troy-bee-AHN-er",
      "range": "Although N. treubiana mainly grows rooted along drainage channels in cliff faces, where water is concentrated following periods of rain, it can also be observed growing rooted in the cracks of bare rock, where practically no substrate is present. Growing in such habitats, N. treubiana is exposed to direct sun and, during the height of the dry season, may frequently experience temperatures above 35°C with little or no rain for many weeks.",
      "distribution": "Nepenthes treubiana is widely distributed across the cliffs of the McCluer Gulf, on the west coast on New Guinea. It is also reported from the coast of the Fak Fak peninsula, to the south-east of the town of Fak Fak.",
      "altitude": "0–80",
      "field_notes": ""
    },
    {
      "id": 130,
      "species": "N. truncata",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "trʌŋˈkɑːtə",
      "pronunciation_2": "trung-KAR-ter",
      "range": "The species grows terrestrially in stunted, lowland heath forest and scrub, and as an epiphyte perched close to the canopy level upon the wide branches of giant, tropical trees in lowland dipterocarp forest. Epiphytic populations also occur in mossy, lower and upper montane forest on humid ridges and mountain summits.",
      "distribution": "Nepenthes truncata occurs widely across Dinagat and northern and central Mindanao.",
      "altitude": "0-1500",
      "field_notes": "A wild population discovered in 2013 bears some of the largest traps ever seen in the genus Nepenthes. However, this species is so threatened by poaching that it has been deemed necessary to keep their whereabouts secret."
    },
    {
      "id": 131,
      "species": "N. undulatifolia",
      "img_credit": "Joachim Nerz",
      "img_credit_2": "Andreas Wistuba",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 4,
      "pronunciation_1": "ʌndjuːlætɪfoʊliə",
      "pronunciation_2": "un-due-lat-ih-FOE-lee-er",
      "range": "Nepenthes undulatifolia occurs in mossy forest and open landslips on steep ridges.",
      "distribution": "At present known only from the type locality in Sulawesi Tenggara. Exact locality data has been withheld for conservation purposes.",
      "altitude": "1800",
      "field_notes": ""
    },
    {
      "id": 132,
      "species": "N. veitchii",
      "img_credit": "Stewart McPherson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "ˈvaɪtʃi.aɪ or veɪtʃi.aɪ",
      "pronunciation_2": "VYE-chee-eye",
      "range": "It grows terrestrially in heath forest, upper montane forest and scrub on ridge tops and mountains summits and as an epiphyte in lowland dipterocarp forest and lower montane forest.",
      "distribution": "Nepenthes veitchii occurs widely across the northern half of Borneo, especially in the mountainous interiors of Sabah, Sarawak and central Kalimantan.",
      "altitude": "0–1600",
      "field_notes": ""
    },
    {
      "id": 133,
      "species": "N. ventricosa",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Stewart McPherson",
      "pitcher_type": "upper",
      "pitcher_type_2": "upper",
      "regions": 7,
      "pronunciation_1": "vɛntrɪˈkoʊzə",
      "pronunciation_2": "ven-trih-KOSE-er",
      "range": "It grows terrestrially or as an epiphyte in lower montane forest, amongst degraded or recovering secondary vegetation, on exposed cliffsides, landslide areas and roadside embankments.",
      "distribution": "Nepenthes ventricosa was previously known only from Luzon, in the north of the Philippine archipelago, where it is widely distributed, but populations of this taxon were recently discovered on Panay.",
      "altitude": "1000-2000",
      "field_notes": ""
    },
    {
      "id": 134,
      "species": "N. vieillardii",
      "img_credit": "Jacques Besnard",
      "img_credit_2": "Jacques Besnard",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 6,
      "pronunciation_1": "ˌviː.ɛˈlɑrdi.aɪ",
      "pronunciation_2": "vee-eh-LARD-ee-eye or vee-ay-YARD-ee-eye",
      "range": "It grows terrestrially amidst ferns and scrub, on the margins of pine forests, in upland grassy meadows, among degraded or reconvering secondary vegetation, in logged lowland forest, and also on bare substrate on exposed cliffsides, landislide areas or direct sunlight and is strogly associated with lateritic substrate, developed on ultrabasic tock types that are deficient of organic matter and prone to seasonal drought.",
      "distribution": "Nepenthes vieillardii is endemic to the main island of New Caledonia and the nearby Île des Pins.",
      "altitude": "0-850",
      "field_notes": ""
    },
    {
      "id": 135,
      "species": "N. villosa",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "vɪˈloʊzə",
      "pronunciation_2": "vih-LOW-zer",
      "range": "Nepenthes villosa grows amidst stunted, mossy, upper montane forest and scrub.",
      "distribution": "Nepenthes villosa is found only on the upper slopes of Mount Kinabalu and Mount Tambuyukon in Sabah.",
      "altitude": "2300-3240",
      "field_notes": ""
    },
    {
      "id": 136,
      "species": "N. vogelii",
      "img_credit": "Jeremiah Harris",
      "img_credit_2": "Jeremiah Harris",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 3,
      "pronunciation_1": "voʊˈɡɛli.aɪ",
      "pronunciation_2": "voe-GELL-ee-eye",
      "range": "It grows mainly as an epiphyte on mossy branches of trees in lower montane forest.",
      "distribution": "Nepenthes vogelii occurs across the highlands of Sarawak, southern Sabah and West Kalimantan.",
      "altitude": "1000-1500",
      "field_notes": ""
    },
    {
      "id": 137,
      "species": "N. barcelonae",
      "img_credit": "Alastair Robinson",
      "img_credit_2": "Alastair Robinson",
      "pitcher_type": "upper",
      "pitcher_type_2": "lower",
      "regions": 7,
      "pronunciation_1": "bɑːrsəˈloʊn.aɪ",
      "pronunciation_2": "bar-SA-lone-eye",
      "range": "This species grows mainly as a terrestrial upright to scrambling shrub in summit scrub, but also less commonly as an epiphyte within the shaded conditions of taller trees.",
      "distribution": "Nepenthes barcelonae is known only from the Central Sierra Madre range of Luzon where it was first collected in 2006 by Ulysses Ferreras and Leonardo Co.",
      "altitude": "1550-1900",
      "field_notes": ""
    }
  ]
}